In [1]:
import pandas as pd

# 读取数据文件
data = pd.read_csv("baby_names.txt", sep="\t")

# 打印前几行数据
print(data.head())

        Name  Birth Year Gender  Count
0   Isabella        2015      M    465
1  Charlotte        2010      F    957
2        Ava        2013      F    890
3       Emma        2013      M    887
4     Olivia        2017      M    118

In [4]:
# 统计数据集中男孩名字和女孩名字各是多少。

In [9]:
import pandas as pd

# 读取数据文件
data = pd.read_csv("baby_names.txt", sep="\t")

# 统计男孩和女孩名字数量
boy_names = data[data["Gender"] == "M"]["Name"].nunique()
# boy_names = data[data["Gender"] == "M"]["Name"].count()就是出现了就算, nunique是不重复的
girl_names = data[data["Gender"] == "F"]["Name"].nunique()

# 打印结果
print("男孩名字数量:", boy_names)
print("女孩名字数量:", girl_names)

男孩名字数量: 10
女孩名字数量: 10

In [20]:
# type(data[data["Gender"] == "M"]["Name"])

pandas.core.series.Series

In [22]:
# 按照Name字段将数据集进行分组并求和赋值给变量names，最后输出前五行。

In [23]:
# 按照 Name 字段进行分组并求和
names = data.groupby("Name").sum()

# 输出前五行
print(names.head(5))

           Birth Year  Count
Name
Amelia          16105   4689
Ava             24174   7311
Charlotte       22153   5941
Emma            22165   6811
Isabella        22149   5549

/var/folders/nw/5s06sntd385dltr9fp63npnc0000gn/T/ipykernel_5044/3868108461.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  names = data.groupby("Name").sum()

In [25]:
# 按照每个名字被使用的次数（Count）对第二步中结果进行降序排序，得出最受欢迎的的五个名字。

In [31]:
names = names.drop(['Birth Year'], axis= 1)
names

           Count
Name
Amelia      4689
Ava         7311
Charlotte   5941
Emma        6811
Isabella    5549
Liam        3206
Mia         5451
Noah        6719
Olivia      4796
Sophia      1552

In [34]:
popular_names = names.sort_values(by="Count", ascending=False)
popular_names

           Count
Name
Ava         7311
Emma        6811
Noah        6719
Charlotte   5941
Isabella    5549
Mia         5451
Olivia      4796
Amelia      4689
Liam        3206
Sophia      1552

In [43]:
popular_names.head(5).index.tolist()

['Ava', 'Emma', 'Noah', 'Charlotte', 'Isabella']

In [46]:
# 在数据集中，共出现了多少个名字？(不包含重复项)
names.index

Index(['Amelia', 'Ava', 'Charlotte', 'Emma', 'Isabella', 'Liam', 'Mia', 'Noah',
       'Olivia', 'Sophia'],
      dtype='object', name='Name')

In [49]:
import numpy as np

In [51]:
np.count_nonzero(names.index)

10